_org_posts/_posts/2020-01-27-STL-priority-queue.org
#+HTML: ---
#+HTML: title: STL priority queue
#+HTML: tag: STL
#+HTML: ---

** STL priority queue
- Max heap, Min heap이 필요할 때

** 헤더 추가하기

#+BEGIN_SRC cpp
#include <queue>
using namespace std;
#+END_SRC

** Min heap 변수 선언
#+BEGIN_SRC cpp
priority_queue < int, vector<int>, greater<int> > pq;

priority_queue<string, vector<string>, greater<string> >pq;

priority_queue< pair<int, int>, vector< pair<int, int> >, greater< pair<int, int> > >pq;
#+END_SRC

pair는 first를 기준으로 정렬된다.

** Max heap 변수 선언

#+BEGIN_SRC cpp
priority_queue < int, vector<int>, less<int> > pq;

priority_queue<string, vector<string>, less<string> >pq;
#+END_SRC

** 우선순위큐 empty 될 때까지 loop

#+BEGIN_SRC cpp

while( ! pq.empty() )
{
    int cost = pq.top().first;
    int num = pq.top.second;
    pq.pop();
    
    ...
    ...
    pq.push(make_pair(x, y));
}
#+END_SRC



